# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
 
# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
 
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
 
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, PatchEmbed, [40, 4, 4, nn.BatchNorm2d]],  # 0-P1/4
   [-1, 1, BasicStage, [40, 1]],  # 1
   [-1, 1, PatchMerging, [80,2,2]],  # 2-P2/8
   [-1, 1, BasicStage, [80, 1]],  # 3
   [-1, 1, BasicStage, [80, 1]],  # 4
   [-1, 1, PatchMerging, [160,2,2]],  # 5
   [-1, 1, BasicStage, [160, 1]],  # 6
   [-1, 1, BasicStage, [160, 1]],  # 7
   [-1, 1, BasicStage, [160, 1]],  # 8
   [-1, 1, BasicStage, [160, 1]],  # 9
   [-1, 1, BasicStage, [160, 1]],  # 10
   [-1, 1, BasicStage, [160, 1]],  # 11
   [-1, 1, BasicStage, [160, 1]],  # 12
   [-1, 1, BasicStage, [160, 1]],  # 13
   [-1, 1, PatchMerging, [320,2,2]], # 14
   [-1, 1, BasicStage, [320, 1]], # 15
   [-1, 1, BasicStage, [320, 1]], # 16
   [-1, 1, SPPF, [320, 5]],  # 17
  ]
 
# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 13], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [256, False]],  # 21
 
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [128, False]],  # 25 (P3/8-small)
 
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 22], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [256, False]],  # 28 (P4/16-medium)
 
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [512, False]],  # 31 (P5/32-large)
 
   [[25, 28, 31], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]